from flask import Flask,render_template

# ==================================================
# インスタンス生成
# ==================================================
app = Flask(__name__)

# ==================================================
# ルーティング
# ==================================================
@app.route('/hello')
def hello():
    return "<h1>Hello！</h1>"

@app.route('/')
def public_index():
    return render_template('public/index.html')

# ==================================================
# 実行
# ==================================================
if __name__ == '__main__':
    app.run()
